// Нужно написать программу, которая бы находила частное двух целых чисел, вводимых пользователем
double numberA = 12;
double numberB = 5;
Console.WriteLine(numberA/numberB);
