// Задача 5. Напишите программу, которая на входе принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до NConsole.WriteLine("Hello, World!");
