// Нужно написать программу, которая бы находила сумму двух целых чисел, вводимых пользователем
int numberA = new Random().Next(1,10);
Console.WriteLine (numberA);
int numberB = new Random().Next(1,10);
Console.WriteLine (numberB);
Console.WriteLine(numberA+numberB);
