// написать программу, которая на входе принимает число и выдает его квадрат (число умноженное само на себя)

Console.Write("Введите число ");
int number = int.Parse(Console.ReadLine());
int sqr = number*number;
Console.WriteLine($"Квадрат числа равен {number} = {sqr}");

